{"data":{"site":{"siteMetadata":{"title":"Harris Jose","author":"Harris Jose"}},"markdownRemark":{"id":"da314d80-a59e-5287-9c27-911c0fd7e691","html":"<p>I gave a presentation at work recently about the whole <strong>CSS vs CSS in JS</strong> debacle and about why we should be looking at CSS in JS more seriously. I’m pretty sure I messed it up but I think the slides came out to be kinda nice even though I made them in 2 hours 😐.</p>\n<div class=\"py-1\"></div>\n<blockquote>\n<p>These slides go in two directions - top-down and left-right. If you’re looking through them remember to go down before going to the next slide. Also the TL;DR version of the talk is right below, just in case anyone’s interested.</p>\n</blockquote>\n<div class=\"py-2\"></div>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 66.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"//slides.com/harrisjose/cssinjs/embed?style=dark\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \">\n</iframe>\n          </div>\n          \n<p>CSS by itself is a very good way to style <strong>documents</strong>. I emphasize documents because I believe CSS is not the best way to style apps. A few annoying things about having to use CSS at scale, in web apps are</p>\n<ul>\n<li>There is currently no way to enforce scoping for your styles. The cascade is a good idea for documents, not applications.</li>\n<li>No dependency management built in. The previous point about the cascade applies here too.</li>\n<li>No way to get data into and out of CSS. Particularly frustrating when you have to maintain constants in both JS and CSS.</li>\n<li>Dead Code Elimination is hard to do in CSS because we don’t know what will be used, until it is used.</li>\n</ul>\n<p>There are newer specifications coming out in CSS like <a href=\"\">Grid</a> for example, but these are designed to solve problems of style. But styling isn’t the only problem we have.</p>\n<p>When styling apps you want <strong>style to be a function of your state</strong>. Which is a rather nice way of describing CSS in JS if you think about it. Well parts of it, at least. Css in JS solves the problems I’ve listed above elegantly and for me that alone is enough to justify using it, even in existing projects.</p>\n<h2>Recommended Reading</h2>\n<p><a href=\"https://medium.com/@rofrischmann/styles-as-functions-of-state-1885627a63f7\">CSS in JS: Style as a function of State</a>\n<a href=\"https://moox.io/blog/farewell-css/\">Farewell CSS</a>\n<a href=\"https://www.youtube.com/watch?v=X_uTCnaRe94\">An unified Styling Language</a></p>","frontmatter":{"title":"Why CSS in JS deserves your attention","date":"July 29, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/css-in-js-ftw/","previous":{"fields":{"slug":"/emberjs-2018/"},"frontmatter":{"title":"EmberJS 2018 - My Wishlist"}},"next":null}}