{"data":{"site":{"siteMetadata":{"title":"Harris Jose","author":"Harris Jose"}},"markdownRemark":{"id":"2821191f-f6b2-5d0e-9e0e-25c6bb8b8150","html":"<p>I kinda gave a talk recently about the whole <strong>CSS vs CSS in JS</strong> debacle and about why we should be looking at CSS in JS more seriously. I’m pretty sure I messed up the talk but I think the slides came out to be kinda nice even though I made them in 2 hours.</p>\n<div class=\"py-1\"></div>\n<blockquote>\n<p>These slides go in two directions - top-down and left-right. If you’re looking through them remember to go down before going to the next slide. Also the <strong>TL;DR</strong> version of the talk is right below, just in case anyone’s interested.</p>\n</blockquote>\n<div class=\"py-2\"></div>\n<!-- <iframe src=\"//slides.com/harrisjose/cssinjs/embed?style=dark\" width=\"576\" height=\"420\" scrolling=\"no\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe> -->\n<p>CSS by itself is a very good way to style <strong>documents</strong>. I emphasize documents because I do not believe CSS is the best way to style apps. A couple of the most annoying things about having to use CSS - at scale - in web apps are</p>\n<ul>\n<li>There is currently no way to enforce scoping for your styles. The cascade is a good idea for documents, not applications.</li>\n<li>No dependency management built in. Previousl point about the cascase applies here too.</li>\n<li>No way to get data into and out of CSS. Particulary frustrating when you have to maintain separate constants in JS and CSS to orchestrate stuff</li>\n<li>Dead Code Elimination is hard to do in CSS because we don’t know what will be used untill it’s used.</li>\n</ul>\n<p>There are newer specifications coming out in CSS like “css grid” for example, but these are designed to solve problems of style. But styling isn’t the only problem we have.</p>\n<p>When styling apps you want <strong><em>style to be a function of your state</em></strong>. Which is a rather nice way of describing CSS in JS (parts of it atleast) if you think about it a bit.</p>","frontmatter":{"title":"Why CSS in JS deserves your attention.","date":"July 29, 2018"}}},"pageContext":{"slug":"/css-in-js-ftw/","previous":{"fields":{"slug":"/emberjs-2018/"},"frontmatter":{"title":"EmberJS 2018 - My Wishlist"}},"next":null}}